---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.LayerElemCompoundElemType
source: html/cd7e304b-bcad-f926-97e9-c9982ce1126d.htm
---
# Autodesk.Revit.DB.ParameterTypeId.LayerElemCompoundElemType Property

"Compound Element Type"

## Syntax (C#)
```csharp
public static ForgeTypeId LayerElemCompoundElemType { get; }
```